<?php

/**
 * Aбстрактний клас Admin Base містить загальну логіку для контролерів, які
 * используются в панели администратора
 */
abstract class AdminBase
{

    /**
     * Метод, який перевіряє користувача на те, чи є він адміністратором
     * @return boolean
     */
    public static function checkAdmin()
    {
        // Перевірка авторизований користувач. Якщо немає, він буде переадресовано
        $userId = User::checkLogged();

        // Отримуємо інформацію про поточного користувача
        $user = User::getUserById($userId);

        // Якщо роль поточного користувача "admin", пускаємо його в адмінпанель
        if ($user['role'] == 'admin') {
            return true;
        }

        //Інакше завершуємо роботу з повідомленням про закритому доступі
        die('Access denied');
    }

}
